Revit 2024 API
GroupTypeId.ElectricalEngineering Property
 Electrical Engineering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId ElectricalEngineering { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalEngineering As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalEngineering {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace